/*	
	&          按位与
    |          按位或
    ^          按位异或
    ~          取反
    <<         左移
    >>         右移

& : (同1则为1，否则为0)
21 & 18
0001 0101
0001 0010
->
0001 0000

| ： (同0则为，否则为1)
21 | 18
0001 0101
0001 0010
->
0001 0111
^ : (不同为1，同为0)
~ : (0为1，1为0)
<< : 左移
>> : 右移
*/
#include <stdio.h>
int main(void) {
	int n1 = 15; 
	short n2 = 15;
	unsigned short n3 = 15;
	unsigned char c = 15;
	n1 <<= 15; 
	n2 <<= 15;
	n3 <<= 15;
	c <<= 6; 
	printf( "n1=%x,n2=%d,n3=%d,c=%x,c<<4=%d",
		n1,n2,n3,c,c << 4);
}
//a>>n&1 为a的第n位